<template>
    <div class="base-editor">
        <slot :editor="editor" />
    </div>
</template>

<script setup>
import { useEditor } from '@tiptap/vue-3';
import { extensionConfigs } from '@/utils/editor/extensions/configs';

const props = defineProps({
    content: {
        type: String,
        required: false
    },
    editable: {
        type: Boolean,
        required: false,
        default: false
    }
});

const TEMP_DEFAULT_CONTENT = `<h1><strong>Hello world!</strong></h1><p>Федеральный закон №349 "О внесении изменений в КАС РФ"
Поправки в КАС
Государственная дума приняла Федеральный закон №349 "О внесении изменений в КАС РФ". Закон от 24.07.2023 изменения в отечественный Кодекс административного судопроизводства — кодифицированный нормативный акт, регулирующий правовые нормы рассмотрения Верховным Судом РФ.
Определили подсудность дел по вопросам опровержения дел о кадастровой стоимости
Региональный Верховный суд и дальше будет разбирать дела по первой инстанции об итогах определения кадастровой стоимости. Дополнительно он будет оспаривать решения, принятые бюджетными организациями субъекта РФ, имеющего полномочия устанавливать кадастровую стоимость по соответствующим заявлениям.
Определён список сопроводительной документации к иску об оспаривании КАС
Иск, подаваемый по нормам действующего административного законодательства, если речь идёт об оспаривании ранее принятого решения ГБУ, должен подаваться по определённому алгоритму. К нему необходимо приложить отчёт в электронном виде о проведении мониторинга и объективной оценки рыночной стоимости недвижимости, выписку из ЕГРН с информацией относительно объекта недвижимости. Также понадобится справка о правах или их ограничении относительно определённого объекта недвижимости с соответствующей ценой, взятой из отчёта.
К заявлению необходимо приложить документы с подтверждением присутствия в оспариваемом решении ГБУ ошибок.
Резолютивная часть обязательно должна включать перечисленные далее аспекты:
3.1. В процессе работы над рассматриваемым делом об обжаловании ранее утверждённого решения ГБУ по заявлению по вопросу определения размера кадастровой стоимости приняты некоторые изменения. Теперь цена земли, принятая для налогообложения, определяется согласно обновленным правилам в эквиваленте рыночной цены. Потому в резолютивную часть вынесенного коллегией судебного решения необходимо в обязательном порядке включить конкретное обозначение имеющейся величины КС выбранного объекта в эквиваленте его рыночной цены. Данный пункт берётся во внимание при условии, что подобное требование заблаговременно выдвинуто истцом в рамках административного процесса.
3.2. При признании принятого решения ГБУ несостоятельным по результатам работы над заявлением об исправлении найденных в процессе проведения мониторинга ошибок, допущенных в процессе установки цены объекта, которая используется для налогообложения, в резолюции судебного решения обозначается обязанность ГБУ устранить их.
Сокращение бюрократических процедур
Предположим, судебная инстанция решила поменять сведения относительно КС. Копия такого решения после его вступления в законную силу отправляется в подразделение федеральной структуры исполнительной власти, проводящее внесение сведений в специальный кадастр, регистрацию государственных прав, ведение ЕГРН, внесение данных о КАС в специализированные государственные информационные ресурсы.
Предусмотрена ответственность на законодательном уровне за невыполнение судебного акта!
Появилась ответственность за неисполнение решения суда или несвоевременное сообщение об исполнении органами управления на местах и государственной власти, организациями, ответственными лицами, а также муниципальными уполномоченными работниками. За халатное отношение к своим обязанностям суд имеет право применить к перечисленным лицам штрафные санкции в определённом размере. Так, для органов государственного управления сумма штрафа составляет не больше 100 тысяч в национальной валюте. Для органов местного самоуправления с публичными функциями размер штрафа не превышает восемьдесят тысяч рублей. Для организаций предусмотрен штраф в размере пятидесяти тысяч рублей, а для должностных лиц он составляет 30 000. Штраф для служащего установлен в размере не более десяти тысяч рублей, а для гражданина он не превышает пять тысяч рублей.
Что хорошего несут поправки?
Изменения в действующем законодательстве хороши тем, что существующие правила, используемые в процессе оспаривания кадастровой стоимости, обозначены в одной из глав КАС РФ.
Хорошо то, что теперь все правила оспаривания кадастровой стоимости прописаны в одной главе Кодекса административного судопроизводства РФ. До недавнего времени необходимо было оглядываться на двадцать вторую главу "Оспаривания действий или бездействия, решений органов власти". Обновлённая методика, действие которой направлено на оспаривание кадастровой стоимости путём исправления обнаруженных ошибок, полностью легализована. Данному методу уделено особенное внимание непосредственно в КАС Российской Федерации.</p><p><span style="color: #51CF66">This is paragraph.</span></p><p></p><p><a target="_blank" rel="noopener noreferrer nofollow" href="https://www.youtube.com/">This is a link to youtube!</a></p><p></p><ul><li><p><u>Editor is cool</u></p></li><li><p><em>Editor is funny</em></p></li></ul><p></p><ol><li><p><span style="color: #22B8CF">Todo #1</span></p></li><li><p><span style="color: #22B8CF">Todo #2</span></p></li></ol><p></p><blockquote><p>This is a blockquote,,,</p></blockquote><p></p><p></p><p></p><p></p><img src="https://source.unsplash.com/K9QHL52rE2k/800x400" style="width: 100%; height: auto; cursor: pointer;">`;

const editorOptions = getEditorBuildOptions();
const editor = useEditor(editorOptions);

function getExtensions() {
    const usedExtensionNames = new Set();

    for (let name in extensionConfigs) {
        usedExtensionNames.add(name);
    }

    const usedExtensionNamesArray = Array.from(usedExtensionNames);

    const extensions = [];

    for (let extensionName of usedExtensionNamesArray) {
        const config = extensionConfigs[extensionName];

        if (!config.component) {
            continue;
        }

        extensions.push(config.component);
    }

    return {
        usedExtensionNames,
        extensions,
    };
}

function getEditorBuildOptions() {
    const { extensions } = getExtensions();

    return {
        content: props.content ?? TEMP_DEFAULT_CONTENT,
        extensions,
        editable: true || props.editable,
    };
}
</script>
